# Markdown
DavidAnson.vscode-markdownlint
AlanWalk.markdown-toc
vstirbu.vscode-mermaid-preview
bpruitt-goddard.mermaid-markdown-syntax-highlighting

# JSON, YAML, TOML & CSV
bungcip.better-toml
redhat.vscode-yaml
eriklynd.json-tools
GrapeCity.gc-excelviewer
# adamvoss.yaml ==> Not found

# Web (HTML, CSS, JS, ...)
HookyQR.beautify

# React
dsznajder.es7-react-js-snippets

# Python
ms-python.python

# Go
ms-vscode.Go
carolynvs.dep

# Rust
rust-lang.rust
kalitaalexey.vscode-rust

# R ==> No need R at this time
# Ikuyadeu.r-lsp
# Ikuyadeu.r

# gRPC
zxh404.vscode-proto3

# Docker
formulahendry.docker-explorer
ms-azuretools.vscode-docker

# Kubernetes
ipedrazas.kubernetes-snippets

# Ansible
haaaad.ansible

# Git
donjayamanne.githistory
eamodio.gitlens

# AWS
aws-scripting-guy.cform
pradiphudekar.cf-templates

# Terraform
mauve.terraform
wholroyd.HCL

# SVG
cssho.vscode-svgviewer

# Editor
streetsidesoftware.code-spell-checker
emmanuelbeziat.vscode-great-icons

# Shell
# cdsama.shell-snippets ==> Not found

# Vagrant
bbenoist.vagrant
marcostazi.VS-code-vagrantfile

# Bash
mads-hartmann.bash-ide-vscode
