# Markdown
vstirbu.vscode-mermaid-preview
bpruitt-goddard.mermaid-markdown-syntax-highlighting
shd101wyy.markdown-preview-enhanced
AlanWalk.markdown-toc

# JSON, YAML, TOML & CSV
bungcip.better-toml
redhat.vscode-yaml
eriklynd.json-tools
GrapeCity.gc-excelviewer
humao.rest-client

# Web (HTML, CSS, JS, ...)
HookyQR.beautify
dbaeumer.vscode-eslint
ecmel.vscode-html-css
HookyQR.minify
ritwickdey.LiveServer
xabikos.JavaScriptSnippets

# Python
ms-python.isort
ms-python.vscode-pylance
ms-python.python

# Go
golang.go
ms-vscode.Go
carolynvs.dep

# Rust
rust-lang.rust
kalitaalexey.vscode-rust
rust-lang.rust-analyzer
serayuzgur.crates
Swellaby.rust-pack

# R ==> No need R at this time
# Ikuyadeu.r-lsp
# Ikuyadeu.r

# Jupiter ==> No need Jupiter at this time
# ms-toolsai.jupyter
# ms-toolsai.jupyter-keymap
# ms-toolsai.jupyter-renderers
# ms-toolsai.vscode-jupyter-cell-tags
# ms-toolsai.vscode-jupyter-slideshow

# gRPC
zxh404.vscode-proto3

# Docker
formulahendry.docker-explorer
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers

# Kubernetes
ipedrazas.kubernetes-snippets
ms-kubernetes-tools.vscode-kubernetes-tools

# Git
donjayamanne.githistory
eamodio.gitlens

# Cloud (AWS, Google, ...)
aws-scripting-guy.cform
pradiphudekar.cf-templates
googlecloudtools.cloudcode

# Terraform
hashicorp.hcl
hashicorp.terraform

# SVG
cssho.vscode-svgviewer

# Editor
streetsidesoftware.code-spell-checker
emmanuelbeziat.vscode-great-icons

# Shell
ms-vscode.makefile-tools

# Vagrant
bbenoist.vagrant
marcostazi.VS-code-vagrantfile

# Bash
mads-hartmann.bash-ide-vscode

# AI
Blackboxapp.blackbox

# Flutter ==> No need Flutter at this time
# Dart-Code.dart-code
# Dart-Code.flutter
